<?php

namespace SkillUp\DataStructures;

class FixedArray
{
/**
 * SplFixedArray — представляет собой массив с фиксированным количеством элементов. SplFixedArray хранит данные в
 * непрерывном виде, доступные через индексы, а обычные массивы реализованы в виде упорядоченных хэш-таблиц.
 * Данный вид массива работает быстрее, чем обычные массивы, но существуют некоторые ограничении:
 *  1) в качестве ключей могут быть только целые числа > 0
 *  2) длина может быть изменена, но это затратная операция
 * Данная структура хорошо подходит для нумерованных списков.
 */
}