<?php

namespace SkillUp\DataStructures;

class Heaps
{
    /**
     * Кучи - структура данных, представляющая собой дерево, удовлетворяющее свойству кучи: если В является узлом-
     * потомком узла А, то ключ А больше ключа В. Следовательно, корневым узлом будет элемент с наибольшим ключем.
     * Такие кучи называют max-кучами. Если корневой узел содержит минимальный ключ, куча называется min-кучей.
     *
     * Применяются, если необходимо хранить данные в упорядоченном виде. При использовании кучи поиск определенного
     * элемента может быть сделан за линейное время.
     */
}